# Multi-Scale BCAM Fusion
nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  [
    # RGB Stream
    [-1, 1, Focus, [64, 3]],              # 0
    [-1, 1, Conv, [128, 3, 2]],           # 1
    [-1, 3, C3, [128]],                   # 2
    [-1, 1, Conv, [256, 3, 2]],           # 3
    [-1, 9, C3, [256]],                   # 4 - RGB P3
    [-1, 1, Conv, [512, 3, 2]],           # 5
    [-1, 9, C3, [512]],                   # 6 - RGB P4
    [-1, 1, Conv, [1024, 3, 2]],          # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]],     # 8
    [-1, 3, C3, [1024, False]],           # 9 - RGB P5

    # Thermal Stream
    [-4, 1, Focus, [64, 3]],              # 10
    [-1, 1, Conv, [128, 3, 2]],           # 11
    [-1, 3, C3, [128]],                   # 12
    [-1, 1, Conv, [256, 3, 2]],           # 13
    [-1, 9, C3, [256]],                   # 14 - Thermal P3
    [-1, 1, Conv, [512, 3, 2]],           # 15
    [-1, 9, C3, [512]],                   # 16 - Thermal P4
    [-1, 1, Conv, [1024, 3, 2]],          # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]],     # 18
    [-1, 3, C3, [1024, False]],           # 19 - Thermal P5

    # Multi-scale fusion
    [[9,19], 1, BCAM, [1024]],            # 20 - P5 fused (3072 ch)
    [[6,16], 1, BCAM, [512]],             # 21 - P4 fused (1536 ch)
    [[4,14], 1, BCAM, [256]],             # 22 - P3 fused (768 ch)
  ]

head:
  [
    # P5 path
    [20, 1, Conv, [512, 1, 1]],           # 23 - project P5: 3072→512
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 24 - upsample to 40×40
    
    # P4 path
    [21, 1, Conv, [512, 1, 1]],           # 25 - project P4: 1536→512
    [[-1, 24], 1, Concat, [1]],           # 26 - concat P4 + upsampled P5
    [-1, 3, C3, [512, False]],            # 27 - process P4
    
    # P3 path
    [27, 1, Conv, [256, 1, 1]],           # 28 - project: 512→256
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 29 - upsample to 80×80
    [22, 1, Conv, [256, 1, 1]],           # 30 - project P3: 768→256
    [[-1, 29], 1, Concat, [1]],           # 31 - concat P3 + upsampled P4
    [-1, 3, C3, [256, False]],            # 32 - P3 output (for detection)
    
    # Downsample path
    [32, 1, Conv, [256, 3, 2]],           # 33 - P3→P4 downsample
    [[-1, 27], 1, Concat, [1]],           # 34 - concat with P4 path
    [-1, 3, C3, [512, False]],            # 35 - P4 output (for detection)
    
    [35, 1, Conv, [512, 3, 2]],           # 36 - P4→P5 downsample
    [[-1, 23], 1, Concat, [1]],           # 37 - concat with P5 path
    [-1, 3, C3, [1024, False]],           # 38 - P5 output (for detection)
    
    [[32, 35, 38], 1, Detect, [nc, anchors]], # 39
  ]