# Progressive P5→P4→P3 Full Cascade with FiLM
nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]  
  - [116,90, 156,198, 373,326]

backbone:
  [
    ######### Dual Streams (0-19) #############
    # RGB Stream: 0-9
    [-1, 1, Focus, [64, 3]],        # 0
    [-1, 1, Conv, [128, 3, 2]],     # 1
    [-1, 3, C3, [128]],             # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3
    [-1, 9, C3, [256]],             # 4 <- RGB P3
    [-1, 1, Conv, [512, 3, 2]],     # 5
    [-1, 9, C3, [512]],             # 6 <- RGB P4
    [-1, 1, Conv, [1024, 3, 2]],    # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]],     # 9 <- RGB P5

    # Thermal Stream: 10-19
    [-4, 1, Focus, [64, 3]],        # 10
    [-1, 1, Conv, [128, 3, 2]],     # 11
    [-1, 3, C3, [128]],             # 12
    [-1, 1, Conv, [256, 3, 2]],     # 13
    [-1, 9, C3, [256]],             # 14 <- Thermal P3
    [-1, 1, Conv, [512, 3, 2]],     # 15
    [-1, 9, C3, [512]],             # 16 <- Thermal P4
    [-1, 1, Conv, [1024, 3, 2]],    # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]],     # 19 <- Thermal P5

    ######### Progressive Cascade: P5→P4→P3 #############
    
    # Step 1: P5 BCAM (no context)
    [[9,19], 1, BCAM_SingleOutput, [1024]],      # 20: P5 fused
    
    # Step 2: P4 Progressive (receives P5 context)
    [[6,16], 1, BCAM_Progressive, [512, 1024]],  # 21: P4 with simple add
    
    # Step 3: P3 Progressive (receives P4 context, NO attention - just FiLM + projection)
    [[4,14], 1,Progressive_Projection, [256, 512]],   # 22: P3 progressive (d_model=256, coarse=512)
  ]

head:
  [
    # Use P5, P4 progressive, P3 progressive outputs
    [20, 1, Conv, [512, 1, 1]],                     # 23: P5 projection
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 24: P5→P4
    [[-1,21], 1, Concat, [1]],                      # 25: P5_up + P4_progressive
    [-1, 3, C3, [512, False]],                      # 26: P4 processed

    [-1, 1, Conv, [256, 1, 1]],                     # 27: P4 projection
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 28: P4→P3
    [[-1,22], 1, Concat, [1]],                      # 29: P4_up + P3_progressive
    [-1, 3, C3, [256, False]],                      # 30: P3 final

    # Downsample path
    [-1, 1, Conv, [256, 3, 2]],                     # 31: P3→P4
    [[-1,26], 1, Concat, [1]],                      # 32: P3_down + P4_processed
    [-1, 3, C3, [512, False]],                      # 33: P4 final

    [-1, 1, Conv, [512, 3, 2]],                     # 34: P4→P5
    [[-1,23], 1, Concat, [1]],                      # 35: P4_down + P5_projected
    [-1, 3, C3, [1024, False]],                     # 36: P5 final

    [[30, 33, 36], 1, Detect, [nc, anchors]],       # Detection heads
  ]