# P4 + P5 BCAM Only (No P3 BCAM)
# parameters
nc: 3
depth_multiple: 1.00
width_multiple: 1.00

# anchors
anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]  
  - [116,90, 156,198, 373,326]

backbone:
  [
    ######### Dual Streams (Identical) #############
    # RGB Stream: 0-9
    [-1, 1, Focus, [64, 3]],        # 0
    [-1, 1, Conv, [128, 3, 2]],     # 1-P2/4
    [-1, 3, C3, [128]],             # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3-P3/8
    [-1, 9, C3, [256]],             # 4
    [-1, 1, Conv, [512, 3, 2]],     # 5-P4/16
    [-1, 9, C3, [512]],             # 6
    [-1, 1, Conv, [1024, 3, 2]],    # 7-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]],     # 9

    # Thermal Stream: 10-19
    [-4, 1, Focus, [64, 3]],        # 10
    [-1, 1, Conv, [128, 3, 2]],     # 11-P2/4
    [-1, 3, C3, [128]],             # 12
    [-1, 1, Conv, [256, 3, 2]],     # 13-P3/8
    [-1, 9, C3, [256]],             # 14
    [-1, 1, Conv, [512, 3, 2]],     # 15-P4/16
    [-1, 9, C3, [512]],             # 16
    [-1, 1, Conv, [1024, 3, 2]],    # 17-P5/32
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]],     # 19

    ######### P3: Simple Concat (No BCAM) #############
    [[4,14], 1, Concat, [1]],       # 20: P3 concat (256+256=512)
    [-1, 1, Conv, [256, 1, 1]],     # 21: Project to 256

    ######### P4 + P5: BCAM Only #############
    [[6,16], 1, BCAM_SingleOutput, [512]],   # 22: P4 fused
    [[9,19], 1, BCAM_SingleOutput, [1024]],  # 23: P5 fused
  ]

head:
  [
    # Use fused features from P4/P5, simple concat for P3
    [-1, 1, Conv, [512, 1, 1]],             # 24: P5 projection (1024->512)
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 25: P5竊単4
    [[-1,22], 1, Concat, [1]],              # 26: P5 up + P4 fused
    [-1, 3, C3, [512, False]],              # 27: P4 processed

    [-1, 1, Conv, [256, 1, 1]],             # 28: P4 projection (512->256)
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 29: P4竊単3
    [[-1,21], 1, Concat, [1]],              # 30: P4 up + P3 concat
    [-1, 3, C3, [256, False]],              # 31: P3 final

    # Downsample path
    [-1, 1, Conv, [256, 3, 2]],             # 32: P3竊単4
    [[-1,27], 1, Concat, [1]],              # 33: P3 down + P4 processed
    [-1, 3, C3, [512, False]],              # 34: P4 final

    [-1, 1, Conv, [512, 3, 2]],             # 35: P4竊単5
    [[-1,24], 1, Concat, [1]],              # 36: P4 down + P5 projected
    [-1, 3, C3, [1024, False]],             # 37: P5 final

    [[31, 34, 37], 1, Detect, [nc, anchors]], # Detection heads
  ]