# Single-Scale BCAM Fusion at P5
nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

backbone:
  [
    # RGB Stream
    [-1, 1, Focus, [64, 3]],              # 0
    [-1, 1, Conv, [128, 3, 2]],           # 1
    [-1, 3, C3, [128]],                   # 2
    [-1, 1, Conv, [256, 3, 2]],           # 3
    [-1, 9, C3, [256]],                   # 4 - P3
    [-1, 1, Conv, [512, 3, 2]],           # 5
    [-1, 9, C3, [512]],                   # 6 - P4
    [-1, 1, Conv, [1024, 3, 2]],          # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]],     # 8
    [-1, 3, C3, [1024, False]],           # 9 - P5 RGB

    # Thermal Stream
    [-4, 1, Focus, [64, 3]],              # 10
    [-1, 1, Conv, [128, 3, 2]],           # 11
    [-1, 3, C3, [128]],                   # 12
    [-1, 1, Conv, [256, 3, 2]],           # 13
    [-1, 9, C3, [256]],                   # 14 - P3
    [-1, 1, Conv, [512, 3, 2]],           # 15
    [-1, 9, C3, [512]],                   # 16 - P4
    [-1, 1, Conv, [1024, 3, 2]],          # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]],     # 18
    [-1, 3, C3, [1024, False]],           # 19 - P5 Thermal

    # Fusion
    [[9,19], 1, BCAM, [1024]],            # 20 - P5 fused (outputs 3072 ch)
  ]

head:
  [
    # P5 processing
    [20, 1, Conv, [512, 1, 1]],           # 21 - project 3072→512
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 22 - upsample to 40×40

    # P4 path
    [6, 1, Conv, [512, 1, 1]],            # 23 - RGB P4 features
    [[-1, 22], 1, Concat, [1]],           # 24 - concat P4 + upsampled P5
    [-1, 3, C3, [512, False]],            # 25 - P4 output
    
    # P3 path
    [25, 1, Conv, [256, 1, 1]],           # 26 - project 512→256
    [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 27 - upsample to 80×80
    [4, 1, Conv, [256, 1, 1]],            # 28 - RGB P3 features
    [[-1, 27], 1, Concat, [1]],           # 29 - concat P3 + upsampled P4
    [-1, 3, C3, [256, False]],            # 30 - P3 output (detection)

    # Bottom-up path
    [30, 1, Conv, [256, 3, 2]],           # 31 - downsample P3→P4
    [[-1, 25], 1, Concat, [1]],           # 32 - concat with P4 path
    [-1, 3, C3, [512, False]],            # 33 - P4 output (detection)

    [33, 1, Conv, [512, 3, 2]],           # 34 - downsample P4→P5
    [[-1, 21], 1, Concat, [1]],           # 35 - concat with P5 path
    [-1, 3, C3, [1024, False]],           # 36 - P5 output (detection)

    [[30, 33, 36], 1, Detect, [nc, anchors]], # 37 - Detect
  ]