# Two-level gating system:
# 1. Modality gating at P5/P4 (learnable, independent)
# 2. Semantic scaling at FPN→P3 (fixed α = 0.3)

nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]  
  - [116,90, 156,198, 373,326]

backbone:
  [
    ######### Dual Streams #############
    # RGB Stream
    [-1, 1, Focus, [64, 3]],        # 0
    [-1, 1, Conv, [128, 3, 2]],     # 1
    [-1, 3, C3, [128]],             # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3
    [-1, 9, C3, [256]],             # 4  # RGB P3
    [-1, 1, Conv, [512, 3, 2]],     # 5
    [-1, 9, C3, [512]],             # 6  # RGB P4
    [-1, 1, Conv, [1024, 3, 2]],    # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]],     # 9  # RGB P5

    # Thermal Stream
    [-4, 1, Focus, [64, 3]],        # 10
    [-1, 1, Conv, [128, 3, 2]],     # 11
    [-1, 3, C3, [128]],             # 12
    [-1, 1, Conv, [256, 3, 2]],     # 13
    [-1, 9, C3, [256]],             # 14 # Thermal P3
    [-1, 1, Conv, [512, 3, 2]],     # 15
    [-1, 9, C3, [512]],             # 16 # Thermal P4
    [-1, 1, Conv, [1024, 3, 2]],    # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]],     # 19 # Thermal P5

    ######### Progressive Fusion with Modality Gating #############
    
    # P5: Self-attention + Modality gating + Cross-attention
    [[9,19], 1, BCAM_TrueSelfAttention_ModalityGated, [1024]], # 20
    
    # P5 → P4 SCP context
    [20, 1, Conv, [64, 1, 1]],                      # 21
    [[20, 21], 1, SCP_Enhanced_Upsample, [64]],     # 22
    
    # P4: Context + Self-attention + Modality gating + Cross-attention
    [[6, 22], 1, Concat, [1]],                      # 23: RGB + ctx
    [23, 1, Conv, [512, 1, 1]],                     # 24
    [[16, 22], 1, Concat, [1]],                     # 25: Thermal + ctx
    [25, 1, Conv, [512, 1, 1]],                     # 26
    [[24, 26], 1, BCAM_TrueSelfAttention_ModalityGated, [512]], # 27
    
    # P3: Simple concat (no modality gating)
    [[4, 14], 1, Concat, [1]],                      # 28
    [-1, 1, Conv, [256, 1, 1]],                     # 29
  ]

head:
  [
    ######### FPN with Semantic Scaling #############
    
    # P5 processing
    [20, 1, Conv, [512, 1, 1]],                     # 30
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 31
    
    # P4 = P5_up + P4_fused
    [[31, 27], 1, Concat, [1]],                     # 32
    [-1, 3, C3, [512, False]],                      # 33
    
    # P3 with SEMANTIC SCALING (α = 0.3)
    [-1, 1, Conv, [256, 1, 1]],                     # 34: Project P4
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 35: Upsample
    [-1, 1, SemanticScale, [256, 0.3]],             # 36: Scale to 30% ← NEW!
    [[36, 29], 1, Concat, [1]],                     # 37: 30% semantic + 100% local
    [-1, 3, C3, [256, False]],                      # 38: P3 final
    
    ######### PAN: Bottom-up #############
    
    [38, 1, Conv, [256, 3, 2]],                     # 39
    [[39, 33], 1, Concat, [1]],                     # 40
    [-1, 3, C3, [512, False]],                      # 41
    
    [41, 1, Conv, [512, 3, 2]],                     # 42
    [[42, 30], 1, Concat, [1]],                     # 43
    [-1, 3, C3, [1024, False]],                     # 44
    
    # Detection heads
    [[38, 41, 44], 1, Detect, [nc, anchors]],       # 45
  ]