# BCAM with Lightweight Self-Attention at P5, Standard BCAM at P4
# Baseline: 77.5 mAP (P5 BCAM + P4 BCAM)
# Test: Does self-attention at P5 improve performance?

nc: 3 # Number of classes
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

backbone: [
    ######### Dual Streams (0-19) - SAME AS YOUR BASELINE #############
    [-1, 1, Focus, [64, 3]], # 0
    [-1, 1, Conv, [128, 3, 2]], # 1
    [-1, 3, C3, [128]], # 2
    [-1, 1, Conv, [256, 3, 2]], # 3
    [-1, 9, C3, [256]], # 4
    [-1, 1, Conv, [512, 3, 2]], # 5
    [-1, 9, C3, [512]], # 6
    [-1, 1, Conv, [1024, 3, 2]], # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]], # 9
    [-4, 1, Focus, [64, 3]], # 10
    [-1, 1, Conv, [128, 3, 2]], # 11
    [-1, 3, C3, [128]], # 12
    [-1, 1, Conv, [256, 3, 2]], # 13
    [-1, 9, C3, [256]], # 14
    [-1, 1, Conv, [512, 3, 2]], # 15
    [-1, 9, C3, [512]], # 16
    [-1, 1, Conv, [1024, 3, 2]], # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]], # 19

    ######### Fusion - TEST TRUE SELF-ATTENTION #############

    # P5: BCAM with TRUE self-attention (Q-K-V)
    [[9, 19], 1, BCAM_TrueSelfAttention_SingleOutput, [1024]], # 20

    # P4: Standard BCAM (baseline)
    [[6, 16], 1, BCAM_SingleOutput, [512]], # 21

    # P3: Simple concat
    [[4, 14], 1, Concat, [1]], # 22
    [-1, 1, Conv, [256, 1, 1]], # 23
  ]

head: [
    [20, 1, Conv, [512, 1, 1]], # 24
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 25
    [[-1, 21], 1, Concat, [1]], # 26
    [-1, 3, C3, [512, False]], # 27
    [-1, 1, Conv, [256, 1, 1]], # 28
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 29
    [[-1, 23], 1, Concat, [1]], # 30
    [-1, 3, C3, [256, False]], # 31
    [-1, 1, Conv, [256, 3, 2]], # 32
    [[-1, 27], 1, Concat, [1]], # 33
    [-1, 3, C3, [512, False]], # 34
    [-1, 1, Conv, [512, 3, 2]], # 35
    [[-1, 24], 1, Concat, [1]], # 36
    [-1, 3, C3, [1024, False]], # 37
    [[31, 34, 37], 1, Detect, [nc, anchors]], # 38
  ]
