# Combined: Self-Attention + SCP Progressive
# Baseline: 77.5 mAP
# SCP alone: 77.86 mAP (+0.36)
# P5+P4 self alone: 77.0 mAP (-0.5)
# Test: Does self-attention + SCP create synergy?
# Hypothesis: Clean P5 features → better SCP context → better P4 refinement

nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10, 13, 16, 30, 33, 23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]

backbone: [
    ######### Dual Streams (0-19) #############
    # RGB Stream: 0-9
    [-1, 1, Focus, [64, 3]], # 0
    [-1, 1, Conv, [128, 3, 2]], # 1
    [-1, 3, C3, [128]], # 2
    [-1, 1, Conv, [256, 3, 2]], # 3
    [-1, 9, C3, [256]], # 4  # RGB P3
    [-1, 1, Conv, [512, 3, 2]], # 5
    [-1, 9, C3, [512]], # 6  # RGB P4
    [-1, 1, Conv, [1024, 3, 2]], # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]], # 9  # RGB P5

    # Thermal Stream: 10-19
    [-4, 1, Focus, [64, 3]], # 10
    [-1, 1, Conv, [128, 3, 2]], # 11
    [-1, 3, C3, [128]], # 12
    [-1, 1, Conv, [256, 3, 2]], # 13
    [-1, 9, C3, [256]], # 14 # Thermal P3
    [-1, 1, Conv, [512, 3, 2]], # 15
    [-1, 9, C3, [512]], # 16 # Thermal P4
    [-1, 1, Conv, [1024, 3, 2]], # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]], # 19 # Thermal P5

    ######### COMBINED: Self-Attention + SCP Progressive #############

    # Step 1: P5 with self-attention (cleans coarse features)
    [[9, 19], 1, BCAM_TrueSelfAttention_SingleOutput, [1024]], # 20: P5 self+cross

    # Step 2: SCP context preparation from CLEANED P5
    [20, 1, Conv, [64, 1, 1]], # 21: Project P5 (1024→64)
    [[20, 21], 1, SCP_Enhanced_Upsample, [64]], # 22: SCP confidence + upsample

    # Step 3: Context-enhanced RGB and Thermal for P4
    [[6, 22], 1, Concat, [1]], # 23: RGB_P4 + SCP_ctx (512+64=576)
    [23, 1, Conv, [512, 1, 1]], # 24: Project (576→512)

    [[16, 22], 1, Concat, [1]], # 25: Thermal_P4 + SCP_ctx (512+64=576)
    [25, 1, Conv, [512, 1, 1]], # 26: Project (576→512)

    # Step 4: P4 with self-attention on context-enhanced features
    [[24, 26], 1, BCAM_TrueSelfAttention_SingleOutput, [512]], # 27: P4 self+cross

    # Step 5: P3 simple cascade
    [27, 1, Conv, [256, 1, 1]], # 28: Project P4
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 29: Upsample to P3
    [[4, 14, 29], 1, Concat, [1]], # 30: RGB_P3 + Thermal_P3 + P4_ctx
    [-1, 1, Conv, [256, 1, 1]], # 31: Project P3
  ]

head: [
    # P5 path
    [20, 1, Conv, [512, 1, 1]], # 32
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 33

    # P4 path
    [27, 1, Conv, [256, 1, 1]], # 34
    [[33, 34], 1, Concat, [1]], # 35
    [-1, 3, C3, [512, False]], # 36

    # P3 path
    [-1, 1, Conv, [256, 1, 1]], # 37
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 38
    [31, 1, Conv, [256, 1, 1]], # 39
    [[38, 39], 1, Concat, [1]], # 40
    [-1, 3, C3, [256, False]], # 41

    # Downsample
    [-1, 1, Conv, [256, 3, 2]], # 42
    [[42, 36], 1, Concat, [1]], # 43
    [-1, 3, C3, [512, False]], # 44

    [-1, 1, Conv, [512, 3, 2]], # 45
    [[45, 32], 1, Concat, [1]], # 46
    [-1, 3, C3, [1024, False]], # 47

    [[41, 44, 47], 1, Detect, [nc, anchors]], # 48
  ]
