# CORRECTED: Gated P3 BCAM - Keeps Working P5+P4 Architecture Intact
# Only modifies P3 processing to test gated context integration

nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]  
  - [116,90, 156,198, 373,326]

backbone:
  [
    ######### Standard YOLO Dual Streams (0-19) #############
    # RGB Stream: 0-9
    [-1, 1, Focus, [64, 3]],        # 0
    [-1, 1, Conv, [128, 3, 2]],     # 1
    [-1, 3, C3, [128]],             # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3
    [-1, 9, C3, [256]],             # 4 <- RGB P3
    [-1, 1, Conv, [512, 3, 2]],     # 5
    [-1, 9, C3, [512]],             # 6 <- RGB P4
    [-1, 1, Conv, [1024, 3, 2]],    # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]],     # 9 <- RGB P5

    # Thermal Stream: 10-19
    [-4, 1, Focus, [64, 3]],        # 10
    [-1, 1, Conv, [128, 3, 2]],     # 11
    [-1, 3, C3, [128]],             # 12
    [-1, 1, Conv, [256, 3, 2]],     # 13
    [-1, 9, C3, [256]],             # 14 <- Thermal P3
    [-1, 1, Conv, [512, 3, 2]],     # 15
    [-1, 9, C3, [512]],             # 16 <- Thermal P4
    [-1, 1, Conv, [1024, 3, 2]],    # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]],     # 19 <- Thermal P5

    ######### WORKING P5+P4 BCAM (UNCHANGED) #############
    
    # Step 1: P5 BCAM (EXACT SAME AS WORKING VERSION)
    [[9,19], 1, BCAM_SingleOutput, [1024]],         # 20: P5 fused
    
    # Step 2: P4 BCAM (EXACT SAME AS WORKING VERSION)
    [20, 1, Conv, [512, 1, 1]],                     # 21: Project P5 context
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 22: Upsample P5 to P4 size
    [[6, 16, 22], 1, Concat, [1]],                  # 23: Cat RGB_P4 + Thermal_P4 + P5_context
    [-1, 1, Conv, [512, 1, 1]],                     # 24: Project concatenated features
    [-1, 1, Conv, [512, 1, 1]],                     # 25: RGB P4 enhanced
    [24, 1, Conv, [512, 1, 1]],                     # 26: Thermal P4 enhanced
    [[25, 26], 1, BCAM_SingleOutput, [512]],        # 27: P4 BCAM
    
    ######### ONLY CHANGE: GATED P3 PROCESSING #############
    
    # Step 3: Clean P3 BCAM (isolated, like Test 1 that got 0.66 mAP)
    [[4, 14], 1, BCAM_SingleOutput, [256]],         # 28: Clean P3 BCAM (no context)
    
    # Step 4: Gated integration of P4 context
    [27, 1, Conv, [256, 1, 1]],                     # 29: Project P4 BCAM result (512→256)
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 30: Upsample P4 context to P3 size
    [[28, 30], 1, GatedFusion, [256, 256]],         # 31: Gated P3+P4 fusion
  ]

head:
  [
    ######### SAME HEAD AS WORKING VERSION (with index updates) #############
    
    # P5 path (SAME AS WORKING)
    [20, 1, Conv, [512, 1, 1]],                     # 32: Project P5 fused
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 33: P5 upsample
    
    # P4 path (SAME AS WORKING) - Use P4 BCAM result
    [27, 1, Conv, [256, 1, 1]],                     # 34: Project P4 BCAM
    [[33, 34], 1, Concat, [1]],                     # 35: Concat P5_up + P4_BCAM
    [-1, 3, C3, [512, False]],                      # 36: Process P4
    
    # P3 path - Use GATED P3 result (only change)
    [-1, 1, Conv, [256, 1, 1]],                     # 37: Project for P3
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 38: Upsample to P3
    [31, 1, Conv, [256, 1, 1]],                     # 39: Project gated P3 result
    [[38, 39], 1, Concat, [1]],                     # 40: Concat P4_up + gated_P3
    [-1, 3, C3, [256, False]],                      # 41: P3 final

    # Downsample path (SAME AS WORKING)
    [-1, 1, Conv, [256, 3, 2]],                     # 42: P3→P4 down
    [[42, 36], 1, Concat, [1]],                     # 43: Cat with P4 path
    [-1, 3, C3, [512, False]],                      # 44: P4 final

    [-1, 1, Conv, [512, 3, 2]],                     # 45: P4→P5 down
    [[45, 32], 1, Concat, [1]],                     # 46: Cat with P5 path
    [-1, 3, C3, [1024, False]],                     # 47: P5 final

    [[41, 44, 47], 1, Detect, [nc, anchors]],       # Detection heads
  ]