# TEST 2: P3 BCAM with Channel Attention Context Integration
# Uses P4 context as channel-wise weights instead of spatial addition

nc: 3
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]  
  - [116,90, 156,198, 373,326]

backbone:
  [
    ######### Standard YOLO Dual Streams (0-19) #############
    # RGB Stream: 0-9
    [-1, 1, Focus, [64, 3]],        # 0
    [-1, 1, Conv, [128, 3, 2]],     # 1
    [-1, 3, C3, [128]],             # 2
    [-1, 1, Conv, [256, 3, 2]],     # 3
    [-1, 9, C3, [256]],             # 4 <- RGB P3
    [-1, 1, Conv, [512, 3, 2]],     # 5
    [-1, 9, C3, [512]],             # 6 <- RGB P4
    [-1, 1, Conv, [1024, 3, 2]],    # 7
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
    [-1, 3, C3, [1024, False]],     # 9 <- RGB P5

    # Thermal Stream: 10-19
    [-4, 1, Focus, [64, 3]],        # 10
    [-1, 1, Conv, [128, 3, 2]],     # 11
    [-1, 3, C3, [128]],             # 12
    [-1, 1, Conv, [256, 3, 2]],     # 13
    [-1, 9, C3, [256]],             # 14 <- Thermal P3
    [-1, 1, Conv, [512, 3, 2]],     # 15
    [-1, 9, C3, [512]],             # 16 <- Thermal P4
    [-1, 1, Conv, [1024, 3, 2]],    # 17
    [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
    [-1, 3, C3, [1024, False]],     # 19 <- Thermal P5

    ######### P5 + P4 BCAM + P3 CHANNEL ATTENTION #############
    
    # Step 1: P5 BCAM (same as working approach)
    [[9,19], 1, BCAM_SingleOutput, [1024]],         # 20: P5 fused
    
    # Step 2: P4 BCAM (same as working approach) 
    [20, 1, Conv, [512, 1, 1]],                     # 21: Project P5 context
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 22: Upsample P5 to P4 size
    [[6, 16, 22], 1, Concat, [1]],                  # 23: Cat RGB_P4 + Thermal_P4 + P5_context
    [-1, 1, Conv, [512, 1, 1]],                     # 24: Project concatenated features
    [-1, 1, Conv, [512, 1, 1]],                     # 25: RGB P4 enhanced
    [24, 1, Conv, [512, 1, 1]],                     # 26: Thermal P4 enhanced
    [[25, 26], 1, BCAM_SingleOutput, [512]],        # 27: P4 BCAM
    
    # Step 3: Generate P4 global context for P3 guidance
    [6, 1, nn.AdaptiveAvgPool2d, [1]],               # 28: P4 RGB global context (Bx512x1x1)
    [16, 1, nn.AdaptiveAvgPool2d, [1]],              # 29: P4 Thermal global context (Bx512x1x1)
    [[28, 29], 1, Concat, [1]],                     # 30: Combined P4 context (Bx1024x1x1)
    [-1, 1, Conv, [64, 1, 1]],                      # 31: Compress context (Bx64x1x1)
    
    # Step 4: Apply channel attention to P3 features
    [[4, 31], 1, ChannelAttention, [256, 64]],      # 32: RGB P3 + channel attention from P4
    [[14, 31], 1, ChannelAttention, [256, 64]],     # 33: Thermal P3 + channel attention from P4
    
    # Step 5: P3 BCAM on channel-guided features
    [[32, 33], 1, BCAM_SingleOutput, [256]],        # 34: P3 BCAM with channel guidance
  ]

head:
  [
    ######### Head Using All Three Progressive BCAMs #############
    
    # P5 path: Use P5 BCAM result
    [20, 1, Conv, [512, 1, 1]],                     # 35: Project P5 fused
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 36: P5 upsample
    
    # P4 path: Use P4 BCAM result
    [27, 1, Conv, [256, 1, 1]],                     # 37: Project P4 BCAM
    [[36, 37], 1, Concat, [1]],                     # 38: Concat P5_up + P4_BCAM
    [-1, 3, C3, [512, False]],                      # 39: Process P4
    
    # P3 path: Use P3 BCAM result with channel attention
    [-1, 1, Conv, [256, 1, 1]],                     # 40: Project for P3
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],     # 41: Upsample to P3
    [34, 1, Conv, [256, 1, 1]],                     # 42: Project P3 BCAM
    [[41, 42], 1, Concat, [1]],                     # 43: Concat P4_up + P3_BCAM
    [-1, 3, C3, [256, False]],                      # 44: P3 final

    # Standard detection head
    [-1, 1, Conv, [256, 3, 2]],                     # 45: P3→P4 down
    [[45, 39], 1, Concat, [1]],                     # 46: Cat with P4 path
    [-1, 3, C3, [512, False]],                      # 47: P4 final

    [-1, 1, Conv, [512, 3, 2]],                     # 48: P4→P5 down
    [[48, 35], 1, Concat, [1]],                     # 49: Cat with P5 path
    [-1, 3, C3, [1024, False]],                     # 50: P5 final

    [[44, 47, 50], 1, Detect, [nc, anchors]],       # Detection heads
  ]