# PMB-CAF: Progressive Multi-Scale Bidirectional Cross-Attention Fusion
# Based on YOLOv5s architecture with progressive fusion
nc: 3  # number of classes (adjust for your dataset)
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 dual-stream backbone
backbone:
  # RGB Stream
  [
   [-1, 1, Focus, [64, 3]],     # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],          # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],          # 4 - RGB P3
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],          # 6 - RGB P4
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]], # 8
   [-1, 3, C3, [1024, False]],  # 9 - RGB P5

   # Thermal Stream  
   [-4, 1, Focus, [64, 3]],     # 10-P1/2 (thermal input via -4)
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 3, C3, [128]],          # 12
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 9, C3, [256]],          # 14 - Thermal P3
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],          # 16 - Thermal P4
   [-1, 1, Conv, [1024, 3, 2]], # 17-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]], # 18
   [-1, 3, C3, [1024, False]],  # 19 - Thermal P5

   # PMB-CAF Progressive Fusion Chain
   [[9, 19], 1, BCAM, [512]],           # 20 - P5 basic fusion
   [[6, 16], 1, BCAM_Progressive, [256, 512]], # 21 - P4 progressive (coarse from P5)
   [[4, 14], 1, BCAM_Progressive, [128, 256]],  # 22 - P3 progressive (coarse from P4)
  ]
head:
  [
   # Process P5 fusion output (20x20, 512ch)
   [20, 1, Conv, [512, 1, 1]],          # 23
   [-1, 1, Conv, [256, 1, 1]],          # 24
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 25: 20x20→40x40
   
   # Process P4 fusion output (40x40, 256ch) 
   [21, 1, Conv, [256, 1, 1]],          # 26
   [[-1, -2], 1, Concat, [1]],          # 27: Cat P4 + upsampled P5 (40x40)
   [-1, 3, C3, [512, False]],           # 28
   
   [-1, 1, Conv, [256, 1, 1]],          # 29
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 30: 40x40→80x80
   
   # Process P3 fusion output (80x80, 128ch)
   [22, 1, Conv, [128, 1, 1]],          # 31  
   [[-1, -2], 1, Concat, [1]],          # 32: Cat P3 + upsampled P4 (80x80)
   [-1, 3, C3, [384, False]],           # 33 (P3/8-small)
   
   # Downsample path
   [-1, 1, Conv, [256, 3, 2]],          # 34: 80x80→40x40
   [[-1, 28], 1, Concat, [1]],          # 35: Cat with P4 path
   [-1, 3, C3, [512, False]],           # 36 (P4/16-medium)
   
   [-1, 1, Conv, [512, 3, 2]],          # 37: 40x40→20x20  
   [[-1, 24], 1, Concat, [1]],          # 38: Cat with P5 path
   [-1, 3, C3, [1024, False]],          # 39 (P5/32-large)
   
   [[33, 36, 39], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]